mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xr/mb9bf16xr.svd
        <!-- REGISTER "AREA5" -->
        <register>
          <name>AREA5</name>
          <description>Area Register 5 [W]</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0050</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA6" -->
        <register>
          <name>AREA6</name>
          <description>Area Register 6 [W]</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0060</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA7" -->
        <register>
          <name>AREA7</name>
          <description>Area Register 7 [W]</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0070</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description>address mask</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM0" -->
        <register>
          <name>ATIM0</name>
          <description>ALE Timing Register 0 [W]</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000045F</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALEW" -->
            <field>
              <name>ALEW</name>
              <description>Address Latch Enable Width</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALES" -->
            <field>
              <name>ALES</name>
              <description>Address Latch Enable Setup cycle</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALC" -->
            <field>
              <name>ALC</name>
              <description>Address Latch Cycle</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM1" -->
        <register derivedFrom="ATIM0">
          <name>ATIM1</name>
          <description>ALE Timing Register 1 [W]</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "ATIM2" -->
        <register derivedFrom="ATIM0">
          <name>ATIM2</name>
          <description>ALE Timing Register 2 [W]</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "ATIM3" -->
        <register derivedFrom="ATIM0">
          <name>ATIM3</name>
          <description>ALE Timing Register 3 [W]</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ATIM4" -->
        <register derivedFrom="ATIM0">
          <name>ATIM4</name>
          <description>ALE Timing Register 4 [W]</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ATIM5" -->
        <register derivedFrom="ATIM0">
          <name>ATIM5</name>
          <description>ALE Timing Register 5 [W]</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ATIM6" -->
        <register derivedFrom="ATIM0">
          <name>ATIM6</name>
          <description>ALE Timing Register 6 [W]</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "ATIM7" -->
        <register derivedFrom="ATIM0">
          <name>ATIM7</name>
          <description>ALE Timing Register 7 [W]</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "SDMODE" -->
        <register>
          <name>SDMODE</name>
          <description>SDRAM Mode Register [W]</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001300</resetValue>
          <resetMask>0x0001FF37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSDCLKOFF" -->
            <field>
              <name>MSDCLKOFF</name>
              <description>MSDCLK OFF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASEL" -->
            <field>
              <name>BASEL</name>
              <description>Bank Address Select</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RASEL" -->
            <field>
              <name>RASEL</name>
              <description>Row Address Select</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CASEL" -->
            <field>
              <name>CASEL</name>
              <description>Column Address Select</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ROFF" -->
            <field>
              <name>ROFF</name>
              <description>Refresh OFF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PDON" -->
            <field>
              <name>PDON</name>
              <description>Power Down ON</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDON" -->
            <field>
              <name>SDON</name>
              <description>SDRAM ON</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REFTIM" -->
        <register>
          <name>REFTIM</name>
          <description>Refresh Timer Register [W]</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000033</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PREF" -->
            <field>
              <name>PREF</name>
              <description>Pre-Refresh</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NREF" -->
            <field>
              <name>NREF</name>
              <description>Number of Refresh</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REFC" -->
            <field>
              <name>REFC</name>
              <description>Refresh Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWRDWN" -->
        <register>
          <name>PWRDWN</name>
          <description>Power Down Count Register [W]</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PDC" -->
            <field>
              <name>PDC</name>
              <description>Power Down Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
