mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xr/mb9bf16xr.svd
        <!-- REGISTER "PZRF" -->
        <register>
          <name>PZRF</name>
          <description>Port Pseudo Open Drain Setting Register F [BHW]</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "WORKFLASH_IF" -->
    <peripheral>
      <name>WORKFLASH_IF</name>
      <description>WorkFlash Memory</description>
      <version>A</version>
      <groupName>WORKFLASH_IF</groupName>
      <baseAddress>0x200E0000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WFASZR" -->
        <register>
          <name>WFASZR</name>
          <description>WorkFlash Access Size Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ASZ" -->
            <field>
              <name>ASZ</name>
              <description>WorkFlash Access Size</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFRWTR" -->
        <register>
          <name>WFRWTR</name>
          <description>WorkFlash Read Wait Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFSTR" -->
        <register>
          <name>WFSTR</name>
          <description>WorkFlash Status Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>WorkFlash Hang</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>WorkFlash Rdy</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>